[
    {
        "changelog_id": "1107738462452457564",
        "entry_id": "1107738462452457565",
        "locale": "en-US",
        "date": "2023-05-22",
        "asset": "https://cdn.discordapp.com/attachments/1091098866503397386/1105561680609562746/image.png",
        "asset_type": 1,
        "content": "Attention, @everyone {added marginTop}\n======================\n\n* **Usernames are evolving.** Over the coming weeks, we will be inviting everyone on Discord (yep, even you) to update to a new username format that will be easier to remember and share with friends. Instead of having a discriminator (the #0001 number), usernames will be entirely unique. You can keep your display name as it is today or choose a wild and crazy one to better express yourself. When it’s your turn to update, we’ll let you know. [Learn more about this change.](https://discord.com/blog/usernames)\n\n\nFor our superfans {progress}\n======================\n\n* **Wumpus Wonderventures Webtoon.** Say that three times fast. To celebrate our awesome fans, we made a webcomic featuring Wumpus and other Discord friends on an adventure. For a limited time, as a reward for your wholesome obsession with Wumpus, you can find and redeem a free 1-month Nitro code (some restrictions apply). Read Wumpus Wonderventures today on [Webtoon](https://go.webtoons.com/1fy0Nzqoxzb).\n* **Discord’s 8th birthday afterparty continues.** In case you missed it: new drops in the [merch store](https://discordmerch.com/dxclog): the *DISXCORE* collection, Elgato stream kits, plushies, just tons of cute stuff.\n\n\nIn other news: Sounds? Good. {improved}\n======================\n\n* **Say more with voice messages.** These were a hit in DMs and small servers, so we are adding them to larger servers. Admins who love silence can [turn this off](https://support.discord.com/hc/articles/13091096725527-Voice-Messages-#h_01GY0QJKCN13FJ6QXWXS6HD8BV) if they wish.\n* **Sound off with soundboard.** Make your voice hangout a little more interesting with duck quacks, throat singing, the Vine boom, or any [sounds curated by your community](https://support.discord.com/hc/en-us/articles/12612888127767-Soundboard-FAQ). Please airhorn responsibly.\n* **Stickers by Discord are now free for all.** Our Wumpus, Mallow, and Choco sticker sets will soon be available to everyone.\n* **New members get a warmer welcome.** Community managers, you can now set up a simple quiz for new members to automatically assign channels and roles. People who join your Capybara Cleanliness Club server will spend less time figuring out how to get perms, and more time admiring pics of a capybara taking a hot bath. So cute…anyway, check out the [blog](https://discord.com/community/community-onboarding) to learn more.\n* **Embedded channel links now look like embedded channel links.** If you’ve ever copied the permalink to a channel or message (half of you reading can probably skip this at this point) and shared it, it probably wasn’t exactly exciting to see a long link with no context about where it was from. We made it so now you know where it takes you.\n\n",
        "min_version": 199933,
        "show_on_startup": false
    },
    {
        "changelog_id": "1250146804461338707",
        "entry_id": "1250146804461338708",
        "locale": "en-US",
        "date": "2023-06-20",
        "asset": "https://cdn.discordapp.com/attachments/1088610810638651463/1250147578486591588/Discord_voice_chat_UI_update_2.jpg?ex=6755dea9&is=666890a9&hm=842139d2e26bb6ab5fcce045e29cb25855664ef6de9395c8114f8e7430a5d7d6&",
        "asset_type": 1,
        "content": "Hellooooo, friend!! <:wumpusdiscord:1019280238196310017>\n\nWe’ve got a big one to share with you: **Starting today, you’ll be able to join a Discord call directly from your PlayStation 5 console — no mobile app needed!** Put your phone aside and let it charge while you game the night away in a Discord call on your PS5, whether you’re hopping into a voice channel in a server or connecting a DM or Group DM call. \n\nAlong with our PS5 updates, we’ve got a handful of new things to share with ya:\n\n- <:shapes:1184226211199733892> New Activities for listening to music and playing games with friends!\n- <:ClydeHeart:1039672878133686282> Tons of quality-of-life improvements & mobile touch-ups. \n- <:Nitro:905275681431253022> Nitro and Shop updates for the most stylish of profiles (including ours? 👀). \n\n[Check out all of June’s big updates on our blog](http://dis.gd/june-2024-changelog), where we’ll have proper descriptions and snazzy visuals to help you go “oooh, THAT’S what that is!” \n\nP.S. We changed the tag next to our name from “System” to “Official” so you know what’s really from Discord.",
        "min_version": 302264,
        "show_on_startup": true
    },
    {
        "changelog_id": "1118660216288985138",
        "entry_id": "1118660216288985139",
        "locale": "en-US",
        "date": "2023-06-22",
        "asset": "https://cdn.discordapp.com/attachments/1073343578769727588/1119021703008366683/2023-Discord-8th-Birthday_Activities_FREECHANGELOG_1920x1080.png",
        "asset_type": 1,
        "content": "For our superfans {progress}\n======================\n\n* **Activities for everyone!!!** That’s right, now anyone can play any Activity any time they want! A big thank you to everyone who played [Activities during our birthday celebration](https://discord.com/blog/celebrate-discord-8th-birthday-free-activities-more). You all loved Activities so much, we made them available to everyone from now on.\n* **New apps, endless possibilities.**  Have more fun with your friends with [4 new apps](https://discord.com/blog/fun-things-to-do-on-discord-apps-activities)! Learn new languages together, inspire each other with motivational quotes, and share your stories or star signs. To explore these apps and more, click on any server’s name and select “App Directory”.\n\n\nFor our admins & creators {improved}\n======================\n\n* **Jump-start your Server Subscriptions.** [Set up your subscriptions](https://discord.com/serversubscriptions) in just a few clicks with **Tier Templates**. Attract more subscribers with **Media Channels**, a new way to share exclusive content with paid subscribers.\n\n",
        "min_version": 207472,
        "show_on_startup": false
    },
    {
        "changelog_id": "1133112494701944892",
        "entry_id": "1133112494701944893",
        "locale": "en-US",
        "date": "2023-07-28",
        "asset": "https://cdn.discordapp.com/attachments/1073343578769727588/1133069036201201745/2022_Activities_Apple_EventCard_1920x1080.png",
        "asset_type": 1,
        "content": "Salutations, superfans {progress}\n======================\n\n* **Meet our calmest Activity yet: Color Together.** If you’re brand new to Activities (or just a little shy) this one's for you. Color Together is an interactive coloring book with relaxing music and dozens of intricate, paint-by-numbers designs. It’s the perfect ambience for a live hangout, and it’s even nice to play solo. Hop into any voice channel to check it out.\n\n\nCreators, cash in {improved}\n======================\n\n* **New ways to monetize are on the way.** Server subscriptions were just the beginning. Our big business brains have come up with [3 more ways](https://discord.com/blog/server-subscriptions-updates-media-channels-tier-templates-and-more) for creators to earn money on Discord. If you’re ready to sell downloadable content, [join the waitlist](https://share.hsforms.com/1u00PIv3XT0mIJjgWMTeesw2bach). \n\n\n\nEarly Access with Nitro {fixed}\n======================\n\n* **Create new memes faster with Remix.** Add text, drawings, emoji, and stickers to images when you upload them from the mobile app. [Remix](https://support.discord.com/hc/articles/15145601963031-Nitro-Remixing#docs-internal-guid-43a62b5f-7fff-aa4f-d9e8-24cdd405e5c4) is in beta and available in select languages with more coming soon, but if you have a Nitro subscription you can try it out now. ",
        "min_version": 216385,
        "show_on_startup": false
    },
    {
        "changelog_id": "1144379466928369715",
        "entry_id": "1144379466928369716",
        "locale": "en-US",
        "date": "2023-09-13",
        "asset": "sTtuGOXtUug",
        "asset_type": 0,
        "content": "Big exciting news {added marginTop}\n===============\n\n* **Stream your gameplay from Xbox to Discord.**\nOne of the most requested features is finally available. Xbox players can now stream games from their Xbox Series X|S or Xbox One directly to friends and communities on Discord. [Connect your accounts](https://discord.com/blog/xbox-stream-to-discord-announcement) to start streaming from the comfort of your couch. \n\nSweet tools for server admins {fixed}\n================\n\n* **Give new members the star treatment**.  Help newcomers feel welcome the moment they join your server. Guide them through rules, channels to join, and any required tasks before chatting. [Learn more](https://support.discord.com/hc/en-us/articles/13497665141655-Server-Guide-FAQ#h_01H55ZWG4YBTASWFS80JQHR19D)\n* **Filter nicknames with AutoMod**. Don't want your members using certain words in their server nicknames? Set up [nickname filters](https://support.discord.com/hc/en-us/articles/4421269296535-AutoMod-FAQ) to enforce your server rules and stop members from chatting until they follow them.\n* **Members in  small servers got mightier**. For servers with fewer than 50 members, we’ve changed permissions so now everyone can add emoji, stickers, Soundboard sounds, and events. If things get too chaotic you can undo this change in Server Settings.\n\nNow playing: your theme music {progress}\n================\n\n* **Announce your arrival with Soundboard**. TV shows have opening sequences. Pro athletes have walk-on songs. With [Soundboard](https://discord.com/blog/ready-your-airhorns-discord-soundboard-is-coming), you can let your friends know you’ve arrived with a choir of angels—or a shrieking pile of rubber chickens, whatever feels right. And with Nitro, you can choose a sound to [play automatically](https://support.discord.com/hc/en-us/articles/12612888127767#h_01H5JJ9XK68MMK1WXBFAQ0AQGR) when you join a voice channel.\n* **Nitro gift cards now [available on Amazon](https://dis.gd/disgiftcard)**. Buy 1, 3, 6, or 12 months of Nitro to email to your bestie or yourself. Stock up when you’re browsing for Halloween costumes, or just send the link to your tech-savvy grandma when she asks what to get you for your birthday. Available in the U.S. only.",
        "min_version": 227102,
        "show_on_startup": true
    },
    {
        "changelog_id": "1163629681954787429",
        "entry_id": "1163629681954787430",
        "locale": "en-US",
        "date": "2023-10-19",
        "asset": "CbVAcKjhcBc",
        "asset_type": 0,
        "content": "IT’S THE DISCORD FALL RELEASE 🍂 {added marginTop}\n===============\n\n* **We’re full to the brim with TONS of new features.** Cozy up with your favorite blanket and read the full scoop on everything that’s new, and a little bit more, on our [Fall Release](https://discord.com/fallrelease?utm_source=changelog&utm_medium=discord&utm_campaign=2023-10_fallrelease&utm_content=--t%3Apm) page. \n\nNEW WAYS TO ENJOY GAMES AND ACTIVITIES {fixed}\n================\n\n* **Try your hand at three new Activities.** Hop in voice and play [Chef Showdown](https://discord.com/activities/1037680572660727838) and [Bobble Bash](https://discord.com/activities/1107689944685748377) with your buddies. Plus, [Jamspace Whiteboard](https://discord.com/activities/1070087967294631976) gets snazzy new tools for brainstorming, creating and mapping things out. Check out all the Activities [on our blog](https://discord.com/blog/server-activities-games-voice-watch-together#heading-3?utm_source=changelog&utm_medium=discord&utm_campaign=2023-10_fallrelease&utm_content=desktop). \n\n* **Capture your clutch plays with Clips.** Releasing in Nitro Early Access, Clips lets you capture your best gameplay moments and share them with your friends. \n\nDECORATE FOR THE SEASON {progress marginTop}\n================\n\n* **Shop for new ways to spruce up your profile:** Try and buy [Avatar Decorations and Profile Effects](/shop/fullscreen?source=1), including limited-time autumn looks. Buy ‘em before they’re gone, and keep ‘em for good, just like your favorite worn-out jeans with a hole in the knee. \n\n* **Nitro members! Switch up Discord’s appearance with new app icons** that let you swap out either the icon on your mobile device’s home screen or the in-app Discord logo on the desktop client. Choose from a wide array of stylish Discord depictions! \n\n* **A ghostly glow looms… HALLOWEEN is approaching!** Devilish decorations, eerily-themed Activities, and Halloween profile effects are here!\n\nKEEP THE CONVERSATION LOVELY {improved}\n================\n\n* **Mods: Keep your server safe and welcoming for all** with three new features: a redesigned [Members page](https://support.discord.com/hc/en-us/articles/15946797617431?utm_source=changelog&utm_medium=discord&utm_campaign=2023-10_fallrelease&utm_content=desktop), [Activity Alerts, and Security Actions](https://support.discord.com/hc/en-us/articles/17439993574167?utm_source=changelog&utm_medium=discord&utm_campaign=2023-10_fallrelease&utm_content=desktop). Admins and community leaders, this one is for you. \n\n* **Follow the Heart of the (Tarot) Cards:** Uncover what your day holds in your Discord — head to our Safety Center to [read into your future with a Safety-themed Tarot reading](https://discord.com/safety-tarot?utm_source=changelog&utm_medium=discord&utm_campaign=2023-10_fallrelease&utm_content=desktop).  \n\n\n",
        "min_version": 238640,
        "show_on_startup": true
    },
    {
        "changelog_id": "1183916476575522836",
        "entry_id": "1183916476575522837",
        "locale": "en-US",
        "date": "2023-12-13",
        "asset": "BF_20iQbkeU",
        "asset_type": 0,
        "content": "’Tis the season for gifting Nitro — or items from the Shop! {added marginTop}\n======================\n\n* **Add a lovely note to your next Nitro gift.** Choose from a selection of virtual greeting cards to go with your [Nitro gift](https://discord.com/settings/premium). Or, grab a Nitro gift card on [Amazon](https://www.amazon.com/Discord-Nitro-1-Month-Subscription-Digital/dp/B0CF4J58QK/ref=sr_1_1) (U.S. only). No tape or scissors needed, and no risk of papercuts. \n* **The Shop is open to @everyone!** Spruce up your profile with items [from the Shop](https://discord.com/shop/fullscreen), freshly stocked with new Monster and Winter-themed collections. And now, you can gift stuff from the Shop!\n\n\nApps, Activities, and awards {fixed}\n======================\n\n* **Level up your tourneys with server Apps.** News flash: we like video games. If you’re reading this, there’s a good chance you do too. Buff your competitive gaming with friends with four server Apps we curated [on our blog](https://discord.com/blog/apps-to-uplevel-your-competitive-gaming-skills?utm_source=changelog&utm_medium=discord&utm_campaign=2023-12_1213changelog&utm_content=--t%3Apm).\n* **New games added to Activities.** We worked with the teams behind “[Colonist](/activities/1106787098452832296)” and “[Krunker Strike FRVR](/activities/1011683823555199066)” to bring their games to Discord. Hop into any voice chat to try them out.  \n* **Congrats to all the winners of The Game Awards!** To say it’s been an incredible year for gaming is a huge understatement. Discord sponsored this year’s Best Multiplayer Game category at The Game Awards (congrats, Baldur's Gate 3!) and premiered a [medieval music video](https://youtu.be/wgp9dqZIWZA).\n\nYour creativity knows no bounds {progress marginTop}\n======================\n\n* **Developers pitched some inspiring ideas.** For our first ever Discord App Pitches fest, devs told us their ideas of apps they want to build for Discord, and five ideas received thousands of dollars in funding. Learn more about App Pitches and the winners [on our blog](https://discord.com/blog/app-pitches-2023?utm_source=changelog&utm_medium=discord&utm_campaign=2023-12_1213changelog&utm_content=--t%3Apm). \n* **Created something you’re proud of? Sell it on your server!** Creators running a Community Server can sell all sorts of digital goods and perks in a dedicated [Server Shop](https://discord.com/serversubscriptions?utm_source=changelog&utm_medium=discord&utm_campaign=2023-12_1213changelog&utm_content=--t%3Apm). Offer things like Server Subscriptions, downloadable files and videos, and even individual roles. \n\nHousekeeping and safekeeping  {improved}\n======================\n\n* **Discord now supports Latin American Spanish.** You no longer have to settle for “Spanish” (wrong) or “Brazilian Portuguese” (definitely wrong). Find the new option in User Settings > Language.\n* **Strengthen your account with a Security Key.** Your conversations and memories are worth protecting. Safeguard them by requiring a Security Key to log in to your Discord account. It’s one of the strongest ways to keep your account safe.\n\n",
        "min_version": 253927,
        "show_on_startup": true
    },
    {
        "changelog_id": "1210371600017530880",
        "entry_id": "1210371600017530881",
        "locale": "en-US",
        "date": "2024-03-05",
        "asset": "https://media.discordapp.net/attachments/1168967256563261501/1211788759356543096/FasterLaunchTime_1.png?ex=66ca523a&is=65dd043a&hm=01af1074f9ff4e2983cd6760b60657dd48d3277edcb520f592565a71787804e7&",
        "asset_type": 1,
        "content": "Making Mobile More Familiar {added marginTop}\n======================\n\n* **See who actually posted the thing you looked up.** Browsing search results on mobile will now show the name of the user who posted the message—because we weren’t doing that before. 😅\n* **Keep your eyes comfy with new Contrast & Saturation Settings on mobile.** Adjust how strong the colors are on Discord to make mobile a joy to look at any time of day. Tinker with these new settings and match them with the perfect theme to make Discord work for you!  \n* **Unmuting the stream you’re watching works properly again.** If you’ve ever tried changing the volume of a stream up from 0 on mobile, it’ll actually unmute instead of gaslighting you into thinking your phone’s speakers broke.\n\nWe Got Some New Deliveries in the Shop! {fixed}\n======================\n\n* **Check out our newly-released Elements collection!** Fry an egg on your face with a Fire decoration, or tell everyone how your avatar is now moist with a Water decoration. Plus, new items in one of our more popular collections are about to drop soon — you’ll *definitely* notice it. \n\nPut Your Best Developer Foot Forward {progress marginTop}\n======================\n\n* **Your Apps now look as stylish as you do.** Developers can now set an animated avatar on their App’s profile. They can also add masked links to their App’s listing on the App Directory, [like this](https://youtu.be/FV5lVPPyDU0?si=57AtrY8cRWxeSUYz)! \n* **We did some early spring cleaning in the Dev Portal, including improvements and fixes in sections related to Premium Apps.** For the final touch, we put some new art on the walls — aka, new icons! \n\nExtra Bits and Bobbles  {improved}\n======================\n\n* **The time it takes for Slash Commands to load has been slashed.** When you type a slash, the command list should load about 60% faster. That’s more time for moderating, playing games, posting images, or whatever questionable antics you have in your Slash Stash. \n* **Find more bobbles to battle against with cross-server matchmaking in Bobble League!** If you take the “league” in Bobble League a bit too seriously, you and up to three friends can search for new opponents to compete with, without hopping between servers to find players.\n",
        "min_version": 271216,
        "show_on_startup": true
    },
    {
        "changelog_id": "1221965747136364625",
        "entry_id": "1221965747136364626",
        "locale": "en-US",
        "date": "2024-04-03",
        "asset": "ygrCj25CYkU",
        "asset_type": 0,
        "content": "Lock In Your Look. Show the World. {improved}\n============\n\n- **VALORANT arrives in the Shop.** Ace your look with Avatar Decorations and Profile Effects based on VALORANT Agents Jett, Reyna, Omen, and the newest Agent: Clove. [Grab ‘em on desktop](http://discord.com/shop) before they head back to HQ.\n- **Choose where people can see your decorations.** Just like per-server avatars and bios, Nitro members can now set avatar decorations and profile effects on a per-server basis.  Hand-select which communities are privileged to see your Cat Ears decoration…\n\nIt’s time to pitch your Activity to us! {added}\n============\n\n- **Devs! This year’s Discord App Pitches are in full swing.** This year, we’re looking for the best community-made Activities to enjoy with friends on Discord. [Submit your pitch](https://discord.com/build/app-pitches-2024) by May 1st for a chance to win up to USD 30,000 and office hours with Discord staff. [Eligibility & Official Rules](https://discord.com/build/app-pitches-2024).\n\nWatch stuff. Hunt stuff. Favorite LOTS of stuff. {fixed}\n================\n\n- **Watch Together gets even better.** Tons of quality-of-life fixes were added, including saving your recent searches for easy rediscovery (only you can see your history). Plus, server admins can now revoke a host’s control if they queued up “rainbow bunchie 10 hours” ten times in a row. \n- **Prepare to hunt with a Monster Hunter Now reward bundle for Nitro members.** If you’ve got Nitro, head into your Gift Inventory from now until April 18th to receive a reward bundle! Use it to adventure in the city with your friends while hunting a Rathalos or two. [More deets here](https://discord.com/blog/monster-hunter-now-reward-bundle-for-nitro-members).\n- **We fixed a really niche bug related to saving way too many GIFs.** Previously, if you favorited an obscene amount of GIFs, the GIF picker would eventually lock up and prevent you from adding or removing them. Thank the person whose GIF picker we had to fix for their noble contribution. \n\nMore Mobile Updates in the Coming Weeks {progress}\n================\n\n- **AirPods users on iOS can now mute their calls using their earbuds.** This is either great for on-the-go talkers on an iPhone or iPad, or a nightmare for people who love to fidget with their hair or their earrings while on a call. Do people actually walk and talk with a big tablet?\n- **Small-but-mighty fixes all over the place!** Keen-eyed mobile users will start noticing some updates to how search filters appear and seeing attachments within your Search results (again). Lastly, when you start a video call on mobile, your friends will be fullscreen by default. Tell them we said hello! 👋",
        "min_version": 281369,
        "show_on_startup": true
    },
    {
        "changelog_id": "1234632884686684233",
        "entry_id": "1234632884686684234",
        "locale": "en-US",
        "date": "2024-05-13",
        "asset": "https://cdn.discordapp.com/attachments/1234965463964979334/1238576906677260372/BDAY_Changelog.png?ex=672bc6a2&is=663e78a2&hm=3f3a84ab5a4ac106230e37e00264a72d61606fe34160db901bfc089b078c31b6&",
        "asset_type": 1,
        "content": "Discord turns 9 this May! And birthdays mean presents… but for YOU. 🫵 \n\nOver the next nine days, we’ll be giving away one-of-a-kind prizes and stuff that makes gaming with your friends on Discord way more fun. Keep an eye out on our social media accounts such as X ([US](https://twitter.com/discord), [Japan](https://twitter.com/discord_JP), [France](https://twitter.com/discord_FR)) and [Instagram](https://www.instagram.com/discord/)!\n\nWe also brought you gifts *right here, right now* in the form of new ways to spend time with your friends and bug fixes to make that time as frictionless as possible. Read on to see what’s new! \n\nMore Fun, During and After The Call {improved}\n===============\n\n- **You can now play an Activity within text channels in servers.** If you’re not feeling like being in Voice but still want to get a few rounds of Blazing 8s in with your friends, we’ve got you covered. Desktop users can use the “+” button in text channels, and mobile peeps can press the shiny new button that we’re about to shout out below (get ready for it):   \n- **Access Apps on mobile with an all-new <:shapes:1184226211199733892> App Launcher.** It’s your one-stop-shop for all your Apps and Activities, right on your mobile chat bar. Easily use App commands with taps instead of typing — no need to worry about which shape goes in the square hole. [Learn more here](https://support.discord.com/hc/articles/21334461140375-Using-Apps-on-Discord).\n- **Ask what @everyone thinks with Polls.** Use Polls to decide what to play, ask your burning and benign questions, or decide if you should chomp an entire jalapeno in one bite! Use the previously-mentioned “+” button to create Polls. +1 to the Plus Button.\n- **On desktop, pop-up profiles now display someone’s mutual servers and friends.** Now it’s just a single click to see which mutuals you share with someone, helping make new connections easier. Also helpful for determining which server someone’s asking for mod help in. \n\nMore Fixes, Less Crashes {improved}\n===============\n\n- **Bluetooth devices now connect properly when you join a call.** Previously, if you joined a call and turned on your Bluetooth headphones, your call wouldn't swap to your newly connected device properly. This now just works, meaning less talking into a device that wasn’t even working. \n- **Permission to Poll: Granted.** Tons of work goes into managing servers. It’s important to have the right tools—and permissions—to do so. Creating Polls in servers is now tied to a new “Create Polls” permission. Save it for just moderators, or let everyone use ‘em!\n- **Mobile is better at not using battery when it doesn’t need to.** Mobile now knows to conserve resources when the app isn’t detecting anyone talking or you’re deafened in a Voice call, letting the app save on battery. Rejoice, VC sleepers! \n- **Crashes are a bummer. Android does that less now.** Our expert dev team resolved a few long-standing Android crashes that were particularly tricky to track down. These fixes reduced the platform's crash rate by over a third — 37% to be precise! */adjusts glasses*\n\nP.S. If you love reading about stuff like Electron updates, unicode rendering fixes, and tangible reductions in crash rates shown in percentages, you’re in luck: our Engineering team has collected the latest technical fixes to show how they’re always making Discord better. \n\nCheck out their Patch Notes [here](https://dis.gd/patch-notes-april-2024)!\n\n",
        "min_version": 292648,
        "show_on_startup": true
    },
    {
        "changelog_id": "1262922149119787141",
        "entry_id": "1262922149119787142",
        "locale": "en-US",
        "date": "2024-07-26",
        "asset": "https://cdn.discordapp.com/attachments/1088610810638651463/1263590947103572018/SpongeBob_Changelog.png?ex=6786c6c6&is=669978c6&hm=2892101803352221e4e391da567c98cf496f32619121acddcdf40bf08844c352&",
        "asset_type": 1,
        "content": "**OOOOH,  🎶 WHO LIVES ON YOUR PROFILE FOR ALL TO SEE? 🎶 SPONGEBOB, IN THE SHOP! 🍍**\n\nSwim on over to the Shop and uncover the new SpongeBob SquarePants collection in honor of the show’s 25th Anniversary! Firmly grasp your favorites and add them to your collection while they’re available.\n\nWe also have some updates to share about all the stuff we’ve done over the last few weeks. Take a peek below! \n\n- **Now you can use Activities in DM & Group DM text chats**, just like you can in a DM voice call or in a server’s text and voice channels! Start a Rythm listening session with some of your Group DM friends without jump-scaring the entire chat by calling them.\n- **A pair of new Activities to compete or kick back with.** Dust off your rocket-jumping skills in Rocket Bot Royale or chill out while tending to your farm in Merge Farm Valley. Go pro or take it slow! \n- **Bring your Apps with you.** Developers can now let you add Apps to your account, providing access to them anywhere you talk. Slap a 🪶/shoebill-fact 🪶 in the middle of chat and watch everyone be amazed at how weird shoebills are. [Fly on over here to learn how](https://support.discord.com/hc/articles/21334461140375). \n- **Profiles on desktop got a facelift**, providing quick access to actions such as sending friend requests or messages. Plus, your status message will show as a thought bubble popping out of your avatar. What’s on your mind today?\n- **Nitro Buy-One-Get-One is this weekend!** Eligible new Nitro members who join before July 31st will get an extra month of Nitro to double up on summer magic! BOGO to the [Blog-o](http://dis.gd/nitro-bogo-2024) to learn about how it works and who qualifies. \n\nInterested in the finer details of performance improvements and bug-squishing? [Check out the latest Patch Notes](https://discord.com/blog/discord-patch-notes-july-1-2024).\n\n",
        "min_version": 310927,
        "show_on_startup": true
    },
    {
        "changelog_id": "1275966022461165631",
        "entry_id": "1275966022461165632",
        "locale": "en-US",
        "date": "2024-08-28",
        "asset": "LVhk8KhNRCw",
        "asset_type": 0,
        "content": "Turn the volume up and listen in: **Amazon Music Unlimited customers can hop into the new “Amazon Music Listening Party” Activity** in voice calls or text chats and listen along to their favorite music or podcasts with their friends! \n\nNever tried Amazon Music before? Qualifying users can launch the Activity to redeem a three-month trial to try it out. Tune in to our [blog](https://discord.com/blog/amazon-music-activity) to see how it all works. Available in select markets. Terms apply.\n\nAlong with the new Amazon Music Activity, we’ve got plenty more to share this month, includinggg:\n\nWhat’s Happening? Dungeon Crawling.  {improved}\n================\n\n- **Server member lists on desktop now showcase a member’s recent activity**, including the games they’ve played and any jams they’ve listened to. Now you’ll know when your friend relaunches your favorite coop game for the first time in ages! \n- **Discord on Xbox is getting a big ol’ buff.** Soon, you’ll be able to see any active server voice channels or the games your Discord friends are playing on your Xbox friends list, directly call a Discord buddy, and watch someone’s Discord stream from your Xbox console! See how it works [here](https://discord.com/blog/see-whats-happening-on-discord-directly-from-your-xbox).\n- **Delve into dungeons in Roll20’s new Discord Activity.** Start a new tabletop campaign and explore nine RPG systems that span multiple worlds and universes, all with your Discord friends in voice. Link your Roll20 account and play all your existing characters and campaigns in Discord! \n\nMake it BIG. Keep Things Mindful.   {improved}\n================\n\n- **You can finally resize the picture-in-picture window on desktop.** This one has been a highly requested feature. Now, you can make your video call as BIG or as small as you want while exploring your servers and chats across Discord. \n- **Speaking of mindful, don’t miss our Teen Charter!** We spoke directly with our teen users globally about what’s important for them to help keep their experiences on Discord comfy. Together, [we’ve co-created our Teen Charter](https://discord.com/safety-teen-charter), a set of principles that matters most to teens: authenticity, inclusivity, privacy, and transparency. \n\nOur Engineering Team’s latest Patch Notes includes fixes such as the mobile app now sending you a notification if something you tried to send didn’t actually send (oops). See the latest they’ve shared [here](https://discord.com/blog/discord-patch-notes-august-1-2024).",
        "min_version": 322113,
        "show_on_startup": true
    },
    {
        "changelog_id": "1281371454679683183",
        "entry_id": "1281371454679683184",
        "locale": "en-US",
        "date": "2024-09-26",
        "asset": "UDwRoz4MAOs",
        "asset_type": 0,
        "content": "Looking for something fun to do? Tap into <:shapes:1184226211199733892> apps anywhere on Discord and discover new ways to play games, listen to music, and watch videos together!\n\nThe <:shapes:1184226211199733892> App Launcher, now available on desktop and mobile, lets you easily bring more fun to any of your chats and voice calls. Search through thousands of apps directly within the App Launcher, or browse curated collections. If you find one you like, you can add it to your account for easy access! \n\nHop in one of your conversations and press the <:shapes:1184226211199733892> button to try them for yourself! Learn about what’s new with apps over at our [blog](https://dis.gd/TryApps).\n\nTest Drive That New App Launcher! {improved}\n================\n\n- **FOUR new Activities to check out for any occasion.** Battle other servers in “Arena Kingdoms,” solve daily tricky Chess puzzles in “Echo Chess,” sink your opponent’s ships in the Viking-themed PVP game “Battletabs,” and learn more about your server buddies in “Magic Circle.” Find ‘em in the App Launcher!\n- **Use Apps to edit images directly in chat.** The next time you hover over an image, tap the App Launcher on the top-right of it to make your photo bounce, add a caption, and more. Try using Viggle’s “Animate” command on a pic of your friend and watch as they show off their new dance moves directly in chat! Who knew they had it in ’em?\n- **Can’t find the perfect Activity? Why not build your own?** [Developers can now build, launch, and monetize their own eligible Activities](https://dis.gd/BuildWhereTheWorldPlays) directly on Discord. They can even opt-in to be discoverable by anyone to use or play via the App Launcher! \n\nEnhancing Privacy & Account Security {improved}\n================\n\n- **End-to-End Encryption (E2EE) is coming to Audio & Video calls.** [E2EE A/V](http://discord.com/safety/more-private-and-secure) helps ensure your voice and video calls in DMs, Group DMs, server voice channels, and Go Live streams are only accessible by those in the call. During the call, you can [check to make sure your connection is encrypted](https://support.discord.com/hc/en-us/articles/25968222946071/).\n- **With Passkeys, your noggin is now your login.** Now you can [set up a Passkey](https://support.discord.com/hc/en-us/articles/25966860846231) to use your device’s biometric features (like Face ID or Touch ID) to sign in instantly, instead of typing in a password like “st!nkUmz-r0kz.” Passkeys live on your device, and not even Discord can access your biometric data or Passkey. \n\nTrain at the Discord Dojo {improved}\n================\n\n- **We’re making new resources on how to use Discord to the fullest.** My boss might not want me to say this, but look: sometimes, Discord can be *tricky*. That’s why we’ve been making videos and blogs about things like [useful keybinds](https://www.tiktok.com/@discord/video/7412697929380547883) and [formatting your messages](https://discord.com/blog/make-your-discord-messages-bold-italic-underlined-and-more). If you scrolled this far down, you’re likely already a Discord pro — share these with a friend who might find them useful! \n- **Hit the streets with new Street Fighter 6 Shop items and a Quest!** Rep your main while joining in on some casual matches in that FGC server with new SF6 Decorations & Effects in the Shop, based on fighters like Ryu, Chun-Li, Akuma, and more. Plus, complete a Street Fighter 6 [Quest](https://support.discord.com/hc/en-us/articles/22225719947543-Discord-Quests-FAQ) to rock the free \"Battle Field\" Decoration for two months! \n\nHere's your regular reminder that our engineers are absolute *wizards*: they've recently reduced the amount of crashes on iOS by a whopping 84%! See what else they've taken their metaphorical wrenches to in our latest [Patch Notes](https://discord.com/blog/discord-patch-notes-august-30-2024).\n",
        "min_version": 330710,
        "show_on_startup": true
    },
    {
        "changelog_id": "1299102108796063866",
        "entry_id": "1299102108796063867",
        "locale": "en-US",
        "date": "2024-11-18",
        "asset": "WvNc5rREgl0",
        "asset_type": 0,
        "content": "The world of Arcane collides with Discord for the first time — *and for the final time.* \n\nWe’re going all-in and bringing you a special Arcane collection in the Shop in celebration of the show’s final season, containing new Avatar Decorations and Profile Effects featuring Jinx, Vi, Ekko, and iconic Arcane technologies and weapons. \n\nLearn more [on our blog](http://dis.gd/ArcaneShopCL), or head over to the Shop and grab your favorites! \n\nForwarding and… Fish {improved}\n================\n\n- **Wanna share something to another chat? Just Forward it!** Stop stockpiling screenshots of messages you want to share — when hovering over a message, click the new “Forward” button, choose where to send it, and POOF! Off it goes… your storage space will thank you. \n- **Double-check what you’ve been playing while on Discord.** Now you can open your profile on desktop to see a list of games you’ve recently played. You can also [clear a game’s play history](https://support.discord.com/hc/en-us/articles/7931156448919?utm_source=changelog&utm_medium=in-product&utm_campaign=performance&utm_content=activity-status-hc) if you don’t want others to know you spent way too much time 3-ticking your Fishing to 99 in OSRS.\n- **What fish weighs up to 2.5 tons?** If you know the answer, you’ll be a pro at “Quiz Planet,” one of the latest Activities to hit the App Directory! Play with your friends and see which of you knows an unusual amount of info on some indie band no one’s heard of (except YOU apparently). \n\nMaking Discord a Breeze {improved}\n================\n\n- **The mobile app’s waayy better at resizing itself while multitasking**, perfect for those who constantly juggle Discord with other apps on their phone or tablet while also watching 2-hour parkour movies. One-block jump over to [Patch Notes](https://discord.com/blog/discord-patch-notes-november-1-2024?utm_source=changelog&utm_medium=in-product&utm_campaign=performance&utm_content=nov-patch-notes) and see all the stuff we’ve fixed. \n- **On desktop, you can play TikTok embeds directly on Discord.** Your friend can no longer hide by saying “i dont have tiktok installed” when you send them the hundredth mulch video in a week. Mmmmm… mulch….\n- **Next time you go to react to a message, we’ll suggest your top 3 emojis to use.** Whether this encourages you to diversify your emoji usage or stick to the same three you’ve used for years is up to you.\n",
        "min_version": 345368,
        "show_on_startup": true
    },
    {
        "changelog_id": "1314300222482022541",
        "entry_id": "1314300222482022542",
        "locale": "en-US",
        "date": "2024-12-19",
        "asset": "https://cdn.discordapp.com/attachments/1088610810638651463/1319346712787161280/YULE_LOG_1084.gif?ex=68519d60&is=67644f60&hm=773852d1f463837e6930785aac4b55dd4f90d278290a473edc60a67d1af770d2&",
        "asset_type": 1,
        "content": "We’ve made it to the end of the year! Over at Discord HQ, we’ve been looking back on all the small but important things we’ve fixed in 2024 to help make spending time in voice with your friends this season as smooth as possible. \n\nAnd in the festive spirit, our bug-smashing reminiscing took the shape of a poem! To cap off the end of 2024, we’d love to share it with you. \n\n {added marginTop}\n================\n\n*Season’s greetings to all! The year’s at its end. \nDiscord’s even better at helping you talk with your friends,\nSo gather up close, we’ve got a lot to discuss,\nThere’s much we’ve improved for this year’s Fixmas!*\n\n*We’ve fixed up some crashes to help iPhones function. \n84%! That’s a huge reduction.\nAndroid, of course, got its own love and care,\nChat renders faster to help quickly share.*\n\n*Is your phone a square? A rectangle? An oval?\nOur app better adapts to many shapes on mobile. \nIn a lot of servers? Scroll through ’em quicker. \nMobile server switching is 30% slicker.*\n\n*Using GIFs on your phone? Post ’em way more.\nThe GIF Picker’s nearly twice as fast as before.\nAnd we gave a speed boost to our API, \nSo Apps & Activities you’re using will fly.*\n\n*When it’s time to share all those photos you took, \nWe better preserve colors as you remember they look.\nAnd now iPhones regain up to four gigs of space,\nGo download ’em all — memories can’t be replaced.*\n\n*See you next year in 2025,\nBut for now, hop in voice, play, or Go Live. <3*\n\n*P.S. \nIf you [gift someone Nitro](http://dis.gd/NitroGiftingCL) for this festive occasion,\nYou’ll also get your own Avatar Decoration!*\n\n {improved}\n================\n\nWant to learn the exact fixes referenced? You can read a version with Patch Notes citations on [our blog](http://dis.gd/Dec2024FixmasCL).\n\n",
        "min_version": 354698,
        "show_on_startup": true
    },
    {
        "changelog_id": "1351243937800781914",
        "entry_id": "1351243937800781915",
        "locale": "en-US",
        "date": "2025-3-25",
        "asset": "nieYrkCEKFU",
        "asset_type": 0,
        "content": "We’ve got two huge updates for those who love chattin’ around and playing games on desktop. (Which is, you know, why Discord started in the first place!) \n\nThe in-game Overlay receives a massive upgrade, and the desktop app’s sporting a freshened-up look. Both get new customization options to let you make Discord work best for you, whether you’re streaming to show everyone how delicious the cheese naan looks in Monster Hunter or you’re just talkin’ in voice all day.\n\nAn overhaul for the Overlay… {improved}\n================\n\n- **More customizable.** The in-game Overlay is now made up of separate widgets that you can move around and organize your way, to better fit the type of games you’re into. RTS? FPS? Hello Kitty: Island Adventure (yes it’s good)? Adapt the Overlay to your needs. \n- **More functional.** Watch someone’s stream directly from the Overlay. Share your own gameplay in the voice chat you’re in with a single click. And if you’re used to spamming in-game emotes or sprays, using the Soundboard directly from the Overlay will feel juuust like home. \n- **More games supported…-able.** Even with [these new features](http://dis.gd/OverlayDesktopBlogCL), the Overlay works with waaay more games! Quickly glance at your newest Discord notifications while playing even more of your favorite releases. \n\n…a freshened-up look for desktop… {added marginTop}\n================\n\n- **Tweak the desktop app to fit your needs.** Use one of our new base themes (Light, Ash, Dark, Onyx), or choose between three new UI density options to adjust app spacing. We also scooted the Inbox up into the title bar, giving more space to your chats, calls, and other shenanigans. \n- **They’re all easy buttons to button.** For voice and video calls, more buttons are centralized into a single bar instead of being split into tiny lil’ islands. The camera button now stays green when your camera’s in use, in case you forgot that you hid your own video preview during calls. Again.\n- **Plus, the channel list is now resizable**, perfect for reading channels with longer names like #💬-general-discussion-memes-are-banned-here, so you can proudly post memes in there — just as the mods intended. [See everything we’ve updated.](http://dis.gd/OverlayDesktopBlogCL) \n\n…and some cherries on top!  {fixed}\n================\n\n- **Discord? In MY games? More likely than you think.** Eligible game devs now have the power to implement Discord-powered text chat directly in their games! Some games you might play already support it, including Rust, SUPERVIVE, and Pax Dei. See how it works [here](https://support.discord.com/hc/en-us/articles/27893392334359-In-game-Features-Powered-by-Discord-FAQ).\n- **A new Ignore option helps you step away from a conversation** by [hiding someone’s messages in DMs, group chats, and servers](https://support.discord.com/hc/en-us/articles/28084948873623). Ignored users don’t see any indication that you’ve ignored them, and you can easily talk to them again if you decide you’ve had enough breathing room.\n- **Card-collecting conquerors, check out “Spark: Hero Tactics,”** Discord’s new grid-based, deck-building battler. Summon creatures, sling spells, and destroy your opponent’s fortress to claim victory. Find it in the App Launcher on both desktop and mobile! \n\nOn our end, [we’ve adjusted](https://discord.com/blog/discord-patch-notes-march-11-2025) to how we handle API deployments to better protect the most critical parts of Discord from potential reliability issues. \n\nWith these changes, we expect fewer incidents or outages affecting Discord’s core functionality. After all, staying connected with your friends is more important than anything else.\n",
        "min_version": 381653,
        "show_on_startup": true
    },
    {
        "changelog_id": "1382829457181769919",
        "entry_id": "1382829457181769920",
        "locale": "en-US",
        "date": "2025-06-30",
        "asset": "https://cdn.discordapp.com/attachments/1088610810638651463/1387932647627423764/ServerTags.gif?ex=694b2101&is=685dd301&hm=7e9ad27556811e1db69e8f92b5f2c2c21dce472ef6513ba98877fa81553f3a22&",
        "asset_type": 1,
        "content": "**Seen a strange new label next to your friends’ names lately?**\n\nThey’re called **Server Tags**! Rep your chaotic friend space, your favorite game’s official Discord, or communities of any size, directly next to your name. Others can click it to learn about the server you’re repping, and if allowed by server mods, prospective members can join (or apply to join) directly from your Server Tag!\n\nIf you’re in a server that has Server Tags enabled, you can [set a Tag](https://support.discord.com/hc/en-us/articles/31444248479639-Server-Tags#h_01JT6VKRACHQADX7EBXR84QTAQ) in Profile Settings. If you don’t see one for the server you wanna showcase, ask the server’s admins and see if they’ll set one up, or consider Boosting their server! Three Boosts helps admins unlock Server Tags for the entire community.\n\nS-A-V-E-D Avatars & Guessing G-A-M-E-S {improved}\n================\n\n- **On desktop, the last six avatars you used are saved in Profile Settings.** If you like shuffling through many avatars, or you used a weird pic of your buddy Drew mid-sneeze as a joke, you can [quickly swap back to a previous avatar](https://support.discord.com/hc/en-us/articles/4409388345495-Per-Server-Profiles#h_01JPQJ3CM6J1ESP0DWV15FM9F7) so you’re not stuck with Sneezing Drew.\n- **Here’s the S-C-O-O-P: Wordle’s on Discord.** Type `/wordle` in any chat to play Wordle from New York Times Games as a Discord Activity. Watch your friends try and guess today’s word, then, `/share` your results in other channels or DMs to see how many friends take a S-W-I-N-G at it.   \n\nQUICK! Let’s Switch to Fixes {improved}\n================\n\n- [**In April**](https://discord.com/blog/discord-patch-notes-april-3-2025#1)**, we upgraded the Quick Switcher,** making it more likely to show the channel or DM you’re actually trying to get to. If you *don’t* use Quick Switcher and love talking in LOTS of servers, [try it out sometime](https://discord.com/blog/how-to-use-keyboard-shortcuts-on-discord-create-custom-keybinds#5)\\! You’ll start getting to convos faster than you can think of their \\#channel-names.   \n- [**In May**](https://discord.com/blog/discord-patch-notes-may-1-2025#1)**, we added Markdown syntax for email addresses**. Putting an email between brackets `<like this>` will let others quickly send an email by just clicking on it. If you’re still one of those “email” users… you *do* know Discord’s *right here*, right?   \n- [**In June**](https://discord.com/blog/discord-patch-notes-june-3-2025#1)**, mobile image embeds received a nice quality bump** by changing how our mobile app handles image compression. Embeds made from lower-quality images will look MUCH better, and *all* images from mobile will upload and render a little bit faster. \n\nUpgrade Your Community and Your Profile {improved}\n================\n\n- **Put your extra Server Boosts to work** by using them to [unlock new features](https://discord.com/blog/get-more-from-your-boosts-with-new-server-perks)! Along with Server Tags mentioned at the beginning, Enhanced Role Styles will help give your server’s roles glowing gradients. Ooooh, shiiiiny.   \n- **Keep your pile of Quest Avatar Decorations longer.** Nitro members can use many of the past (and upcoming) [Quest-earned Avatar Decorations](https://discord.com/blog/nitro-members-keep-quest-rewards-longer) looong after their two-month time limit, letting you always show off that being a Shadow the Hedgehog fan wasn’t just a phase.   \n- **Even MORE Nameplates arrived in the Shop,** so hop on the desktop app and check 'em out! We’re gonna need a bigger cabinet with how many Nameplates we’ve got stacked! HAHAH!! Get it… plates… you stack them… nameplates… siigh… \n\nSpeaking of stacks, our Engineering team shares a huge stack of fixes and improvements they’ve made to Discord on a monthly basis. You’ll always find ‘em at [dis.gd/PatchNotes](http://dis.gd/PatchNotes).\n",
        "min_version": 414131,
        "show_on_startup": true
    },
    {
        "changelog_id": "1415771752428077126",
        "entry_id": "1415771752428077127",
        "locale": "en-US",
        "date": "2025-09-25",
        "asset": "https://cdn.discordapp.com/attachments/1416095381942698117/1416095545797251173/2024_10_DiscordBlog_DevandEngineers-1_CHANGELOG.png?ex=69b195bf&is=68c447bf&hm=25aa6eb13c060f0c77892e567199f854b1ea6e75b702bd8a055fd9c2a9352391&",
        "asset_type": 1,
        "content": "Bug fixes and performance improvements. Thank you for your time. \n\n*…nah just kiddin’*, we’ve got a TON of stuff to help make your time playing games, hanging out in voice, and generally doing whatever it is you do with your friends on Discord a whole lot better. \n\n<:CLController:1416095715096268864> Big Updates for Big Chillin' {improved}\n================\n\n- **User Profiles on desktop got a refreshed look!** They’ve been updated to help show people more details about who you are, what you’re all about, and the games you’ve been playing lately. And if you’re doing a LOT of stuff at once? Boy, do we have even *better* news for you: \n- **Playing games, listening to music, AND in a voice channel? Show ‘em ALL off!** If you’re doing multiple things at once, they’ll now all show as a stack of cards on your profile. \n- **On desktop, Activities can now be opened in a pop-out window.** Open your Watch Together session in a floating window while you speed through your DMs and servers. No one has ever had the technology to watch a video while doing something else on their PC. Until *now*. \n- **When you turn your device’s camera on, a sound now plays** to let you know that people can see your collection of Coke Zero cans, mechanical keyboards, or whatever the hell those ugly labu-things are. \n\n🛠️ More Pins, A LOT More Server Members {improved}\n================\n\n- [In July](https://discord.com/blog/discord-patch-notes-july-7-2025), we **added support for AV1 video attachments and embeds**, and **sped up the loading of member lists for super-super-large servers**. Like, we’re talking about servers with MILLIONS of people. I can’t even count past 12, idk how these people do it. \n- [In August](https://discord.com/blog/discord-patch-notes-august-4-2025), we **increased the pin limit from 50 to 250** (also a big number) and **added proper embeds for Tumblr posts**. When sent in chat, you’ll see fancy-looking descriptions for links to lots of different Tumblr content! It also shows the #tags used, such as #ball-pit. \n- [In September](https://discord.com/blog/discord-patch-notes-september-3-2025), our engineers became mad wizards and **increased the default server cap to 25M members**. Yes, 25 MILLION (*extremely* big number). \n\n<:CLServerBoost:1416095879449940029> Server Boosts and Boosts of Color  {improved}\n================\n\n- **Nitro’s newest color theme is… whatever you want!** Use the power of 𝓰𝓻𝓪𝓭𝓲𝓮𝓷𝓽𝓼 to help create your own [Custom Theme](https://support.discord.com/hc/en-us/articles/207260127-How-to-Change-Discord-Color-Themes-and-Customize-Appearance-Settings#h_01JXZWY4ZQVKSDMSVG2RMJMFKF). Use up to FIVE different shades of colors to craft your ideal client theme or make some abhorrent mess of mismatched colors. It’ll even sync with mobile! \n- **Spruce up your Server Tag with two new badge packs:** a Pet pack that includes lil’ animals like cats, goats, and a SMAL BEASTE FROGGE, and a Flex pack that contains a sack filled with loadsamoney and a crown, making it fit for a king. Or a frog. \n\nEver seen those Group DM icons that are a bunch of your friends’ avatars in a circle? Internally, we call those “facepiles.” And if you check out Patch Notes, over at [dis.gd/PatchNotes](https://dis.gd/PatchNotes), you may learn more tidbits like this! (And you’ll see the hundreds of other things we fix, too.)\n\n",
        "min_version": 448893,
        "show_on_startup": true
    }
]